// Напишите программу, которая на вход
// принимает два целых числа и проверяет,
// является ли первое число квадратом второго.
// a = 25, b = 5 => да
// a=2, b = 10 => нет
// a = 9, b=-3=> да 
// a = -3, b = 9 => нет

Console.Write("Введите число: ");
int input = Convert.ToInt32(Console.ReadLine());
// "ПРИВЕТ + МИР (конкатинация) = "Привет Мир"
Console.WriteLine(input + 1000);
// Тем самым убирая пару лишних действий